{
  "agile-work": "Agiles Arbeiten",
  "australia": "Australien",
  "bme": "Technische und Wirtschaftswissenschaftliche Universität Budapest",
  "bme-description": "Beherrschung der Grundlagen der Maschinenbauentwicklung. Meine bevorzugten Fächer sind CNC-Automatisierung, Mathematik, Programmiergrundlagen, technische Akustik und Geräuschreduzierung, CAD-Konstruktion.",
  "braunschweig": "Braunschweig",
  "bredex-description": "Mein erster Programmierjob war international, aber vorrangig in einem deutschen Umfeld, in einem Projekt mit Bezug zu Volkswagen. Tech-Stacks:",
  "budapest": "Budapest",
  "cad-cam-cnc-programming": "CAD/CAM, CNC-Programmierung",
  "cg-description": "Ich kam hierher, um an der Konstruktion einer anderen Art von Stahlkonstruktionen zu arbeiten: Hochleistungstransformatoren. Auch meine Masterarbeit im Bereich Mechatronik habe ich hier abgeschlossen.",
  "cg-from-2023": "ab 2023 Ganz Electric",
  "cg-task-1": "Erstellen von Modellen, Zeichnungen und Stücklisten einer Transformator-Stahlbaugruppe in NX",
  "cg-task-2": "Verbesserung der internen Anforderungen und „Standard“-Zeichnungen für besseres und schnelleres Arbeiten",
  "cg-task-3": "Erstellen von Makros in Excel VBA",
  "china": "China",
  "client-frontend": "Klient (Frontend)",
  "codecool-description-1": "Als Erweiterung des Kurses „Java-Backend-Entwickler“ bietet er einen fortgeschrittenen Einblick in die Welt von Java EE und Spring Boot.",
  "codecool-description-2": "Während der COVID-19-Pandemie hatte ich nach meinem Jobverlust ein klares Ziel: ein erfolgreicher Programmierer zu werden. Dank der staatlichen Unterstützung konnte ich im Bootcamp Java Backend völlig kostenlos erlernen.",
  "construction-designer": "Maschinen-Bauplaner",
  "construction-engineer": "Maschinenbauingenieur",
  "contact": "Kontakt Info",
  "deployment-tools": "Deployment Tools",
  "developer": "Entwickler",
  "developing": "Entwicklung",
  "device-assembler": "Gerätemonteur",
  "device-installer": "Geräte-Installateur",
  "dubna": "Dubna",
  "education": "Ausbildung und Weiterbildungen",
  "english": "englisch",
  "four-and-five-axis-programming-technology": "CNC 4- und 5-Achsen-Programmierung-Technologie",
  "ganz-eem-description-1": "Mein erster Job, bei dem ich als Maschinenbauingenieur anfing, lag zunächst ausschließlich im Bereich der Stahlkonstruktion-Designing der Wasserpumpenblöcke des Kernkraftwerks.",
  "ganz-eem-description-2": "Meine Arbeit wurde durch die Erstellung von Produktionsplänen und Qualitätsprotokollen sowie die Organisation von Treffen zur Erörterung technischer Fragen mit den russischen Ingenieurteams leicht erweitert.",
  "ganz-task-1": "Entwurf von Wasserpumpen und erweiterten Wasserversorgungssystemen für Einheiten (in Solidworks, KOMPAS-3D-CAD-Systemen)",
  "ganz-task-2": "Beheben technischer Probleme anhand von Kommentaren von Lieferanten",
  "ganz-task-3": "Dolmetschen zwischen ungarischen und russischen Ingenieur-/Verkaufsgruppen",
  "german": "deutsch",
  "germany": "Deutschland",
  "hard-skills": "Hard Skills",
  "hungarian": "ungarisch",
  "hungary": "Ungarn",
  "innostudio-description": "Ich war in einem Projekt eines ungarischen Unternehmens, welches für die Agentur für wissenschaftliche Raumfahrtindustrie (ESA) durchgeführt wurde, involviert. Sie brauchten einen Maschinenbauingenieur für die Planung eines modularisierten Durchflusschemiegerätes (modularised flow chemical device), welches geplant wurde, um es Space-Shuttle an Bord der ISS zu bringen.",
  "innostudio-task-1": "Entwerfen des mechanischen Steuerung und Flow System in Solidworks",
  "innostudio-task-2": "Vorbereiten von Teilen für den 3D-Printer in einer lokalen Testumgebung",
  "innostudio-task-3": "Verhandlungen mit ESA-Mitgliedern über die Verteilung der „Arbeitslast“",
  "interest": "Hobby",
  "java-backend-developer": "Java Backend Entwickler",
  "java-developer": "Java Entwickler",
  "java-enterprise-backend-developer": "Java Enterprise Backend Entwickler",
  "job-experience": "Berufserfahrung",
  "language": "Sprache",
  "learning": "Lernen",
  "manager-tools": "Manager Tools",
  "me": "Jozsef Csurgai",
  "me-long": "Jozsef David Csurgai",
  "mechanical-engineer": "Maschinenbauingenieur",
  "mechanical-engineer-bsc": "Maschinenbau B.Sc.",
  "mechanical-project-engineer": "Mechanischer Projektingenieur",
  "mechatronics-msc": "Mechatronics M.Sc.",
  "mirrotron-description": "Bisher habe ich mich vor allem mit Produktserien beschäftigt, aber diese Firma hat sich auf sehr spezielle Einzelgeräte spezialisiert, die unter radioaktiver Strahlung arbeiten. Diese sogenannten Neutronenstreugeräte werden üblicherweise in der Nähe eines (Test-)Kernreaktors installiert, wie in ",
  "mirrotron-task-1": "als <tag>{{profession}}</tag>,<br/>Planen von Scattering-Geräten, Umformen der Komponente entlang der Spannungsanalyseprüfung in Solidworks und koordinieren die Montage",
  "mirrotron-task-2": "als <tag>{{profession}}</tag>,<br/>präziser Montage von Teilen und bereits Baugruppen zum Produkt",
  "mirrotron-task-3": "als <tag>{{profession}}</tag>,<br/>On-Site bauen unter präziser Ausrichtung mit Theodolit und Lasertrackersystem",
  "mirrotron-task-4": "als <tag>{{profession}}</tag>,<br/>Erstellen eines Fertigungsprotokolls in Excel VBA zur Überwachung des aktuellen Produktionsstatus",
  "month": "Monat",
  "months-skill": "Monaten",
  "my-duties": "meine Aufgaben:",
  "nct-academy": "NCT Academy",
  "nct-description-1": "Mein Interesse im CNC-Bereich weitete sich immer mehr auf Workstations und mehr als nur 3-Achs-Werkzeugsteuerungen aus. Dies erforderte einen weiteren Entwicklungsansatz auch im CAD- und CAM-Bereich.",
  "nct-description-2": "Um mein Interesse an CNC-Programmierung und -Fertigung zu erweitern, belegte ich einen NQR-Kurs in CAD-, CAM- und CNC-Technologie. Dadurch erhielt ich grundlegende Kenntnisse in der Rohmaterialherstellung, der Steuerung von 3-Achsen-CNC-Maschinen und der Erstellung von Werkzeugführungsprogrammen (in G-Code).",
  "obudai-description": "Auf der Suche nach einer weiteren Herausforderung, sowohl Maschinenbau als auch Programmierung zu studieren, habe ich eine andere Ausrichtung gewählt, um mein Wissen über Mikrocontroller, Näherungssensoren, Optimierungsmethoden und Regelungsmechanismen zu erweitern.",
  "obudai-university": "Óbuda-Universität",
  "peking": "Peking",
  "present": "jetzt",
  "process-developer": "Prozess-Entwickler",
  "profile": "Profil",
  "profile-description-1": "Mein Name ist <strong>Jozsef</strong> David <strong>Csurgai</strong> ({{0}}) und ich bin zertifizierter Softwareentwickler und diplomierter Maschinenbauingenieur. Um andere zu zitieren: \"ich bin aufgeschlossen, verständnisvoll und immer hilfsbereit\". Wie andere bereits erwähnt haben, es ist mir extrem wichtig, alles gut zu vollenden, was ich begonnen habe.",
  "profile-description-2": "Ich war mehr als fünf Jahre im Ingenieurbereich, hauptsächlich als <strong>Maschinenbaukonstrukteur</strong> tätig. Ich arbeitete hauptsächlich mit CAD-Systemen, berechnete Messungen, entwarf mechanische Teile für Maschinenstrukturen und führte Tests mit statischen und dynamischen Überlastungen mit der Finite-Elemente-Methode (FEM) durch. Wann immer ich die Möglichkeit hatte, bestimmte Verwaltungsprozesse zu beschleunigen, erstellte ich Excel-basierte Makros zur Verbesserung des Dokumentationsprozess.",
  "profile-description-3": "Nach einem Wendepunkt änderte ich meine Ziele und fasste den Mut, eine neue Karriere in der IT zu starten. Seit 2020 bis heute arbeite ich hauptsächlich als <strong>Full-Stack-Ingenieur</strong> und verfüge über Kenntnisse sowohl der Backend- als auch der Frontend-Seite für interne Softwareprogramme und auch für Webanwendungen.",
  "remote-artifact-repository": "Remote Artifact Repository",
  "responsible": "Ich war verantwortlich für:",
  "russia": "Russland",
  "russian": "russisch",
  "scrum-method": "Scrum-Methoden",
  "server-backend": "Server (Backend)",
  "soft-skills": "soft Skills",
  "sport": "Sport",
  "sydney": "Sydney",
  "szekesfehervar": "Székesfehérvár",
  "tech-stack-1": "Java mit Frameworks und Plugins (Spring Boot, Thymeleaf, JPA, Hibernate, HTTP Client)",
  "tech-stack-2": "HTML, CSS (SASS)",
  "tech-stack-3": "PostgreSQL, MySQL",
  "tech-stack-4": "Docker (mit Kubernetes zu Platform Heroku)",
  "tech-stack-5": "Java (mit FX)",
  "tech-stack-6": "PostgreSQL",
  "tech-stack-7": "Git VCS (zu GitHub)",
  "tech-stacks-colon": "Tech-Stacks:",
  "trainee-description-1": "Ich begann meine Karriere im Maschinenbau hier als Praktikant in der Abteilung Schweißkonstruktionen. Meine Tätigkeit gehörte zum technischen Verwaltungsbereich. Die meisten meiner Aufgaben umfassten die Konfiguration und Verwaltung von Schweißtechnologien für verschiedene Nähte (WPQ) sowie die Erstellung von Schweißzeichnungen und Schweißprotokollen (WPS).",
  "trainee-description-2": "Viele dieser Jobs waren repetitive „Holzfäller“-Aufgaben, die in einer Excel-Umgebung erledigt wurden. Dadurch hatte ich die Möglichkeit, tief in die VBA-Programmierung einzutauchen. Durch die Erstellung von Makros konnte ich die Grundlagen der funktionalen Programmierung erlernen, was meinen und den administrativen Arbeitsablauf anderer verbesserte.",
  "travelling": "Reise",
  "welding-engineer-intern": "Praktikant Schweißfachingenieur",
  "year": "Jahr",
  "years-skill": "Jahren"
}
