{
  "agile-work": "Agile work",
  "australia": "Australia",
  "azure-cert-204-name": "AZ-204: Microsoft Azure Developer Associate",
  "azure-cert-900-name": "AZ-900: Microsoft Azure Fundamentals",
  "bme": "Budapest University of Technology and Economics",
  "bme-description": "Studying basics with Mechanical Development specialisation. My preferred subjects were CNC automation, Mathematics, Basics of Programming, Technical Acoustics and Noise Control, CAD designing.",
  "braunschweig": "Braunschweig",
  "bredex-description": "My first job as a programmer in an international but mostly in a german environment. I was working with a team in a Volkswagen related project (alias PEGMan; 09.2021 - 06.2025). Currently I am working on an internal project, and also expanding my knowledge using Azure Platform Services. Technical stacks:",
  "budapest": "Budapest",
  "cad-cam-cnc-programmer-technologist-certificate": "CAD/CAM, CNC programmer technologist certificate",
  "cad-cam-cnc-programming": "CAD/CAM, CNC programming",
  "cg-description": "I came here prepared to work with another type of steel construction designing: High Power Transformers. I also made here my Mechatronics MSc diploma thesis.",
  "cg-from-2023": "from 2023 ganz electric",
  "cg-task-1": "Creating models, drawings and part list of a transformer steel assembly in NX",
  "cg-task-2": "Improving inner requirements and 'standard' drawings for better and faster work",
  "cg-task-3": "Making macros in Excel VBA",
  "china": "China",
  "client-frontend": "client (frontend)",
  "codecool-description-1": "As an extension of the Java Backend Developer course, gives an advanced inside to the Java EE platform and Spring Boot.",
  "codecool-description-2": "During the COVID-19, my aim was very clear after I lost my job: become a successful programmer. Thanks to the government's supporting aid, I was able to learn Java Backend completely free in the bootcamp.",
  "construction-designer": "construction designer",
  "construction-engineer": "mechanical construction engineer",
  "contact": "contact info",
  "cv-output-file-name": "Biography_Jozsef_Csurgai.pdf",
  "deployment-tools": "deployment tools",
  "developer": "developer",
  "developing": "developing",
  "device-assembler": "device assembler",
  "device-installer": "device installer",
  "dubna": "Dubna",
  "education": "education",
  "english": "English",
  "four-and-five-axis-programming-technology": "four- and five-axis programming technology",
  "frontend-development-professional-certificate": "Frontend Development Professional certificate",
  "ganz-eem-description-1": "My first place as a Mechanical Engineering where I was bounded strictly to design steel structures for water pump units for NPP-s at the beginning.",
  "ganz-eem-description-2": "My work slightly extended with managing producing schedules, quality plans and organising meetings for discussing technical issues with Russian engineer groups.",
  "ganz-task-1": "Designing water pumps and extended water supply systems for units (in Solidworks, KOMPAS-3D CAD systems)",
  "ganz-task-2": "Correcting technical issues from comments of suppliers",
  "ganz-task-3": "Oral translating between Hungarian and Russian engineer/sales groups",
  "german": "German",
  "germany": "Germany",
  "hard-skills": "hard skills",
  "hungarian": "Hungarian",
  "hungary": "Hungary",
  "innostudio-description": "I was involved in a project, which was in one of the hungarian contribution branch of the scientific space industry (ESA). They needed a mechanical engineer for planning a modularised Flow Chemical Device which was planned to be transported to the ISS through a space shuttle on-board.",
  "innostudio-task-1": "Designing the mechanical controlling and flow system in Solidworks.",
  "innostudio-task-2": "Preparing parts to 3D printing for local testing environment",
  "innostudio-task-3": "Negotiating with ESA members about distribution of 'workload'",
  "interest": "interest",
  "java-backend-developer": "java backend developer",
  "java-developer": "java developer",
  "java-enterprise-backend-developer": "java enterprise backend developer",
  "job-experience": "job experience",
  "junior-enterprise-java-backend-developer-certificate": "Junior Enterprise Java Backend Developer certificate",
  "junior-java-backend-developer-certificate": "Junior Java Backend Developer certificate",
  "language": "language",
  "learning": "learning",
  "manager-tools": "Manager tools",
  "me": "Jozsef Csurgai",
  "me-long": "Jozsef David Csurgai",
  "mechanical-engineer": "mechanical engineer",
  "mechanical-engineer-bsc": "mechanical engineer BSc",
  "mechanical-engineer-bsc-degree": "Mechanical Engineering (BSc) degree",
  "mechanical-project-engineer": "mechanical project engineer",
  "mechatronics-msc": "mechatronics MSc",
  "mirrotron-description": "Most of the time I dealt with products series so far, but this company specialized for very special individual devices which work under radioaktive radiation. These are called Neutron Scattering Devices which are usually installed close to a (testing) Nuclear Reactor in",
  "mirrotron-task-1": "as a <tag>{{profession}}</tag>,<br/>planning scattering devices, reforming shapes along stress analyzer checking in Solidworks, and coordinating construction",
  "mirrotron-task-2": "as a <tag>{{profession}}</tag>,<br/>precise set-up of parts and already built subassemblies into product",
  "mirrotron-task-3": "as a <tag>{{profession}}</tag>,<br/>on-site building under precise alignment with theodolite and laser tracker system",
  "mirrotron-task-4": "as a <tag>{{profession}}</tag>,<br/>creating manufacture protocol in Excel VBA to monitor current production status",
  "month": "month",
  "months-skill": "months",
  "my-duties": "my duties were:",
  "nct-academy": "NCT Academy",
  "nct-description-1": "My interest in the CNC field continued to spread towards workstations to more than 3-axis tool controlling. This required another development approach also in the CAD and CAM field.",
  "nct-description-2": "Extending my interests about CNC programming and manufacture, I took a NQR course in CAD, CAM and CNC technology. This gave me basics of understanding raw material manufacturing, controlling 3-axis CNC machines and making tool guiding programs (in G-code).",
  "obudai-description": "Looking for another challenge to study both mechanical engineering and programming, I took another orientation to enlarge my knowledge about microcontrollers, proximity sensors, optimalisational methods and regulation mechanism.",
  "obudai-university": "Óbudai University",
  "peking": "Peking",
  "present": "Present",
  "process-developer": "process developer",
  "profile": "profile",
  "profile-description-1": "My name is <strong>Jozsef</strong> David <strong>Csurgai</strong> ({{0}}) and I'm a certified Software Engineer, graduated Mechanical Engineer. I'm open-minded, understanding and always willing to help. As others have said before, I have a versatile personality and I am obsessed with finishing anything what I have started.",
  "profile-description-2": "I spent more than 5 years in the engineering field, mostly as a <strong>Mechanical Designer</strong>. I was working mainly with CAD systems, calculating measurements, designing mechanical parts for the structures of machines, and testing by static and dynamic overloads with Finite element methods (FEM). Whenever I've got the opportunity to speed up certain administrative processes, I created Excel-based macros to improve the documentation processes.",
  "profile-description-3": "After a turning point I changed my goals, I took the courage to start my new career on IT. From 2020 'till now I work mainly as a <strong>Full-Stack Engineer</strong>, consisting the knowledge of both Backend and Frontend sides for inner software programs and also web applications.",
  "remote-artifact-repository": "Remote artifact repository",
  "responsible": "I was responsible for:",
  "russia": "Russia",
  "russian": "Russian",
  "scrum-method": "Scrum method",
  "server-backend": "server (backend)",
  "soft-skills": "soft skills",
  "sport": "sport",
  "sydney": "Sydney",
  "szekesfehervar": "Székesfehérvár",
  "tech-stack-1": "Java with Frameworks and Plugins (Spring Boot, Thymeleaf, JPA, Hibernate, HTTP Client)",
  "tech-stack-2": "HTML, CSS (SASS)",
  "tech-stack-3": "PostgreSQL, MySQL",
  "tech-stack-4": "Docker (with Kubernetes to Heroku platform)",
  "tech-stack-5": "Java (with FX)",
  "tech-stack-6": "PostgreSQL",
  "tech-stack-7": "Git VCS (via GitHub)",
  "tech-stacks-colon": "tech stacks:",
  "trainee-description-1": "I began my Mechanical Engineering career path here as a trainee in the Welding Structure division. My job was related to the technical administrational field, most of these tasks were configuring and managing welding technologies for different seams (WPQ), create welding drawings and welding protocols (WPS).",
  "trainee-description-2": "Lots of these jobs were repetative 'wood-cutting' tasks done in Excel environment. It gave me the opportunity to dive deep to learn VBA programming. By creating macros I was able to learn basics of functional programming which also increased mine and other's administrative work-flow.",
  "travelling": "travelling",
  "welding-engineer-intern": "welding engineer intern",
  "year": "year",
  "years-skill": "years"
}
