{
  "agile-work": "Agilis munkavégzés",
  "australia": "Ausztrália",
  "bme": "Budapesti Műszaki és Gazdaságtudományi Egyetem",
  "bme-description": "Alapok elsajátítása gépészeti fejlesztés szakirányon. Előnyben részesített tantárgyaim a CNC automatizálás, matematika, programozási alapismeretek, műszaki akusztika és zajcsökkentés, CAD tervezés.",
  "bredex-description": "Első programozói munkám nemzetközi, de főleg német környezetben, egy Volkswagenhez kapcsolódó projektben. Fejlesztési területek:",
  "cad-cam-cnc-programmer-technologist-certificate": "CAD/CAM, CNC programozó technológus bizonyítvány",
  "cad-cam-cnc-programming": "CAD/CAM, CNC programozás",
  "cg-description": "Felkészülve érkeztem egy másik típusú acélszerkezet-tervezésre; a nagy teljesítményű transzformátorokéra. Itt készítettem a mechatronikai MSc diplomamunkámat is.",
  "cg-from-2023": "2023-tól Ganz Electric",
  "cg-task-1": "Modellek, rajzok és alkatrészlista készítése transzformátor acélszerelvényről NX-ben",
  "cg-task-2": "Belső követelmények és „szabványos” rajzok továbbfejlesztése újra- és jobb felhasználhatóság érdekében",
  "cg-task-3": "Makrók készítése Excel VBA-ban",
  "china": "Kína",
  "client-frontend": "kliens (frontend)",
  "codecool-description-1": "A 'Java Backend fejlesztő' kurzus kiterjesztéseként haladó betekintést ad a Java EE és Spring Boot világába.",
  "codecool-description-2": "A COVID-19 idején az állásom elvesztése után nagyon világos volt a célom: sikeres programozó legyek. A kormány támogatásának köszönhetően teljesen ingyenesen tanulhattam Java-t Backenden a bootcampben.",
  "construction-designer": "konstrukciós géptervező",
  "construction-engineer": "gépész tervezőmérnök",
  "contact": "kapcsolat",
  "cv-output-file-name": "Önéletrajz_Csurgai_József.pdf",
  "deployment-tools": "deployment eszköztár",
  "developer": "fejlesztő",
  "developing": "fejlesztés",
  "device-assembler": "készülék összeállító",
  "device-installer": "készüléktelepítő",
  "dubna": "Dubna",
  "education": "oktatás",
  "english": "angol",
  "four-and-five-axis-programming-technology": "négy-, öttengelyes programozási technológia",
  "frontend-development-professional-certificate": "Frontend Professional Development bízonyítvány",
  "ganz-eem-description-1": "Az első munkahelyem, ahol gépészmérnökként kezdtem el dolgozni kezdetben szigorúan az atomerőművi vízszivattyú blokkjainak acélszerkezeteinek tervezési területen.",
  "ganz-eem-description-2": "Munkám kismértékben kibővült a gyártási ütemtervek, minőségi protokollok készítésével, valamint a műszaki kérdések megvitatására találkozók szervezésével az orosz mérnökcsoportokkal.",
  "ganz-task-1": "Vízszivattyúk és hozzátartozó vízellátó rendszerek tervezése (Solidworks, KOMPAS-3D CAD-ben)",
  "ganz-task-2": "Technikai problémák kijavítása a beszállítók megjegyzései alapján",
  "ganz-task-3": "Szinkronfordítás magyar és orosz mérnök/értékesítő csoportok között",
  "german": "német",
  "germany": "Németország",
  "hard-skills": "hard skills",
  "hungarian": "magyar",
  "hungary": "Magyarország",
  "innostudio-description": "Részt vettem egy projektben, amely a tudományos űripar (ESA) egyik magyarországi érdekeltségű ágazatához tartozott. Gépészmérnökre volt szükségük egy modularizált ún. vegyi áramlásos készülék tervezéséhez, amelyet egy űrsiklón keresztül szállítanak a Nemzetközi Űrállomás fedélzetére (ISS).",
  "innostudio-task-1": "Mechanikus vezérlő és áramlási rendszer tervezése a Solidworks-ben",
  "innostudio-task-2": "Alkatrészek előkészítése 3D nyomtatáshoz a helyi tesztelési környezethez",
  "innostudio-task-3": "Tárgyalásokban való közreműködés az ESA-tagokkal a „terhelés megosztásról”",
  "interest": "érdeklődés",
  "java-backend-developer": "java backend fejlesztő",
  "java-developer": "java fejlesztő",
  "java-enterprise-backend-developer": "java enterprise backend fejlesztő",
  "job-experience": "munkatapasztalat",
  "junior-enterprise-java-backend-developer-certificate": "junior vállalati java backend fejlesztő tanúsítvány",
  "junior-java-backend-developer-certificate": "junior java backend fejlesztő tanúsítvány",
  "language": "nyelv",
  "learning": "tanulás",
  "manager-tools": "Manager tools",
  "me": "Csurgai József",
  "me-long": "Csurgai József Dávid",
  "mechanical-engineer": "gépészmérnök",
  "mechanical-engineer-bsc": "gépészmérnök BSc",
  "mechanical-engineer-bsc-degree": "gépészmérnöki (BSc) diploma",
  "mechanical-project-engineer": "gépész projektmérnök",
  "mechatronics-msc": "mechatronika MSc",
  "mirrotron-description": "Legtöbbször terméksorozatokkal foglalkoztam eddig, de ez a cég nagyon speciális, radioaktív sugárzás alatt működő egyedi készülékekre specializálódott. Ezeket neutronszórás eszközöknek hívják, amelyeket általában egy (tesztelő) atomreaktor közelében helyeznek el, mint",
  "mirrotron-task-1": "mint <tag>{{profession}}</tag>,<br/>neutronszórási eszközök rész és teljes tervezése, alkatrésztervezés optimalizálása a Solidworks feszültségelemző ellenőrzése mellett és az összeállítások koordinálása",
  "mirrotron-task-2": "mint <tag>{{profession}}</tag>,<br/>az alkatrészek és a már beépített részegységek pontos összeállítása",
  "mirrotron-task-3": "mint <tag>{{profession}}</tag>,<br/>helyszíni alapokra precíz igazítása teodolittal és lézeres bemérő rendszerrel",
  "mirrotron-task-4": "mint <tag>{{profession}}</tag>,<br/>gyártási protokoll létrehozása Excel VBA-ban az aktuális gyártási állapot figyeléséhez",
  "month": "hónap",
  "months-skill": "hónap",
  "my-duties": "feladataim:",
  "nct-academy": "NCT Akadémia",
  "nct-description-1": "A CNC terület iránti érdeklődésem tovább terjedt a 3-nál több tengelyes szerszámvezérelt munkaállomások felé. Ez újabb fejlesztési megközelítést igényelt a CAD és CAM területen is.",
  "nct-description-2": "A CNC programozás és gyártás iránti érdeklődésemet bővítve elvégeztem egy OKJ tanfolyamot CAD, CAM és CNC technológiából. Ezzel elsajátítottam a előgyártmány feldolgozását, a 3 tengelyes CNC gépek vezérlésének és a szerszámvezető programok készítésének alapjait (G-kódban).",
  "obudai-description": "Újabb kihívást keresve a gépészmérnöki és a programozási tanulmányokhoz, itt bővítettem tanulmányaimat a mikrokontrollerekről, közelségérzékelőkről, optimalizációs módszerekről és szabályozási mechanizmusokról.",
  "obudai-university": "Óbudai Egyetem",
  "peking": "Peking",
  "present": "jelen",
  "process-developer": "folyamatfejlesztő",
  "profile": "profil",
  "profile-description-1": "<strong>Csurgai József</strong> Dávid ({{0}}) vagyok, okleveles szoftvermérnök gépészmérnöki végzettséggel. Nyitott vagyok, megértő és mindig hajlandó vagyok segíteni. Másokat idézve, sokoldalú személyiséggel rendelkezem, és megszállottan szeretnék mindent befejezni, amit elkezdek.",
  "profile-description-2": "Több mint 5 évet töltöttem el a mérnöki területen, többnyire <strong>gépész tervezőként</strong>. Főleg CAD-en dolgoztam, méréseket végeztem, gépek szerkezetéhez mechanikai alkatrészeket terveztem, valamint statikus és dinamikus túlterhelésekre teszteltem végeselem módszerekkel (FEM). Amikor lehetőségem nyílt bizonyos adminisztrációs folyamatok felgyorsítására, Excel alapú makrókat készítettem a dokumentációs folyamatok javítására.",
  "profile-description-3": "Egy fordulópont után megváltoztattam a céljaimat, és vettem a bátorságot, hogy új pályafutásomat kezdjem meg az informatika területén. 2020-tól mostanáig főként <strong>Full-Stack mérnökként</strong> dolgozom, mind a backend, mind a frontend oldal ismeretében belső szoftverekhez és webes alkalmazásokhoz egyaránt.",
  "remote-artifact-repository": "Remote artifact repository",
  "responsible": "Felelős voltam:",
  "russia": "Oroszország",
  "russian": "orosz",
  "scrum-method": "Scrum módszer",
  "server-backend": "szerver (backend)",
  "soft-skills": "soft skills",
  "sport": "sport",
  "sydney": "Sydney",
  "tech-stack-1": "Java framework-kel és pluginokal (Spring Boot, Thymeleaf, JPA, Hibernate, HTTP Client)",
  "tech-stack-2": "HTML, CSS (SASS)",
  "tech-stack-3": "PostgreSQL, MySQL",
  "tech-stack-4": "Docker (Kubernetes-sel a Heroku platform-ra)",
  "tech-stack-5": "Java (FX-szel)",
  "tech-stack-7": "Git VCS (GitHub-bal)",
  "tech-stacks-colon": "tech. készlet:",
  "trainee-description-1": "Gépészmérnöki pályafutásomat itt kezdtem meg, mint gyakornok a hegesztett acélszerkezetek hegesztési részlegnél. Munkám a műszaki adminisztrációs területhez kapcsolódott, a legtöbb feladat a különböző varratok hegesztési technológiáinak konfigurálása, menedzselése (WPQ), hegesztési rajzok és hegesztési protokollok (WPS) készítése volt.",
  "trainee-description-2": "Ezen munkák közül sok „favágó” Excel környezetben történő feladat volt. Ez lehetőséget adott arra, hogy elmélyítsem a VBA programozást. A makrók létrehozásával elsajátíthattam a funkcionális programozás alapjait, ami az enyém és mások adminisztrációs munkafolyamatát is felgyorsította.",
  "travelling": "utazás",
  "welding-engineer-intern": "hegesztőmérnök gyakornok",
  "year": "év",
  "years-skill": "év"
}